InformationRegisters/РегистрацияОшибок_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияОшибок_ат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВремяПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолученныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Распакован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаРаспаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОшибки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/АвтоотчетОбОшибке_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>АвтоотчетОбОшибке_ат</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОшибки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭкземплярыПродуктов_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СведенияОбОкружении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/Обслуживание_ат/Ext/Module.bsl
Процедура РаспаковкаОтчетовОбОшибках_ат() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.РегистрацияОшибок_ат
		|ГДЕ
		|	(НЕ Распакован)";
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		РезультатВыборки = РезультатЗапроса.Выбрать();
		Пока РезультатВыборки.Следующий() Цикл
			
			Попытка
				ОбработатьОтчетОбОшибке(РезультатВыборки);
			Исключение
				ЗаписатьОшибкуРаспаковкиОтчетаОбОшибке(РезультатВыборки.ИдентификаторОшибки, ОписаниеОшибки());
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьОтчетОбОшибке(РезультатВыборкиОшибки)
	
	Попытка
		
		ВременныйКаталог = Новый Массив;
		ВременныйКаталог.Добавить(КаталогВременныхФайлов());
		ВременныйКаталог.Добавить("ОбработкаОтчетовОбОшибках");
		ВременныйКаталог.Добавить(РезультатВыборкиОшибки.ИдентификаторОшибки);
		ВременныйКаталог = СтрСоединить(ВременныйКаталог, "\");
		
		ДанныеОтчета = РезультатВыборкиОшибки.ПолученныеДанные.Получить();
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".zip");
		ДанныеОтчета.Записать(ИмяВременногоФайла);
		
		Попытка
			
			Архиватор = Новый ЧтениеZipФайла(ИмяВременногоФайла);
			Архиватор.ИзвлечьВсе(ВременныйКаталог);
			Архиватор.Закрыть();
			
			//TESTУдалитьФайлы(ИмяВременногоФайла);
			
		Исключение
			
			Попытка
				
				//TESTУдалитьФайлы(ИмяВременногоФайла);
				//TESTУдалитьФайлы(ВременныйКаталог);
				
			Исключение
			КонецПопытки;
			
			ВызватьИсключение;
			
		КонецПопытки;
		
		Попытка
			
			ИмяОсновногоФайла = СтрШаблон("%1\%2", ВременныйКаталог, "report.json");
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.Прочитать(ИмяОсновногоФайла, КодировкаТекста.UTF8);
			
			ТекстОсновногоФайла = ТекстовыйДокумент.ПолучитьТекст();
			
			//TESTУдалитьФайлы(ВременныйКаталог);
			
		Исключение
			
			//TESTУдалитьФайлы(ВременныйКаталог);
			ВызватьИсключение;
			
		КонецПопытки;
		
		//СсылкаНаОтчет = Документы.ОтчетыОбОшибках.ПолучитьСсылку(РезультатВыборкиОшибки.Идентификатор);
		//ОтчетОбОшибке = СсылкаНаОтчет.ПолучитьОбъект();
		//
		//Если ОтчетОбОшибке = Неопределено Тогда
		//	ОтчетОбОшибке = Документы.ОтчетыОбОшибках.СоздатьДокумент();
		//	ОтчетОбОшибке.УстановитьСсылкуНового(СсылкаНаОтчет);
		//КонецЕсли;
		ОтчетОбОшибке = Документы.АвтоотчетОбОшибке_ат.СоздатьДокумент();
		ОтчетОбОшибке.Дата = РезультатВыборкиОшибки.ДатаВремяПолучения;
		//ОтчетОбОшибке.АвторКлиента = ф;
		ОтчетОбОшибке.ИдентификаторОшибки = РезультатВыборкиОшибки.ИдентификаторОшибки;
		//ОтчетОбОшибке.ИмяПользователя = ф;
		//ОтчетОбОшибке.ИнформационнаяБаза = ф;
		//ОтчетОбОшибке.СведенияОбОкружении = ф;
		ОтчетОбОшибке.ТекстОтчета = ТекстОсновногоФайла;
		ОтчетОбОшибке.Записать();
		
		ЗаписьРегистрации = РегистрыСведений.РегистрацияОшибок_ат.СоздатьМенеджерЗаписи();
		ЗаписьРегистрации.ИдентификаторОшибки = РезультатВыборкиОшибки.ИдентификаторОшибки;
		
		Если ЗаписьРегистрации.Выбран() Тогда
			
			ЗаписьРегистрации.Распакован = Истина;
			ЗаписьРегистрации.Записать();
			
		КонецЕсли;
		
	Исключение
		
		ЗаписатьОшибкуРаспаковкиОтчетаОбОшибке(РезультатВыборкиОшибки.ИдентификаторОшибки, ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьОшибкуРаспаковкиОтчетаОбОшибке(ИдентификаторОшибки, ОписаниеОшибки)
	
	ЗаписьРегистрации = РегистрыСведений.РегистрацияОшибок_ат.СоздатьМенеджерЗаписи();
	ЗаписьРегистрации.ИдентификаторОшибки = ИдентификаторОшибки;
	
	Если ЗаписьРегистрации.Выбран() Тогда
		
		ЗаписьРегистрации.Распакован = Истина;
		ЗаписьРегистрации.ОшибкаРаспаковки = ОписаниеОшибки;
		ЗаписьРегистрации.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
